/* 
  Localizable.strings
  Sao's PDF Kit

  Created by 河野 さおり on 2016/02/23.
  Copyright © 2016年 河野 さおり. All rights reserved.
*/

//File error alert.massageText
"FILE_ERROR_MESSAGETEXT" = "File Not Found Error:";

//File error alert.informativeText
"FILE_ERROR_INFOTEXT" = "file does not exist or is not ordinary.";

//PDF read error status window.messageText
"PDF_READ_ERROR_MESSAGETEXT" = "Failed to read the file.";

//PDF read error status window.informativeText
"PDF_READ_ERROR_INFOTEXT" = "The file does not exist...";

//Button Store Work Stade Action End messageText
"SAVE_FILELIST_MESSAGETEXT" = "Save Successful.";

//Button Store Work Stade Action End messageText
"SAVE_FILELIST_INFOTEXT" = "Saving of work state has completed.";

//Page range text
"ALL_PAGES" = "All Pages";

//View menu item title strings
"MnTitleEnterFullScreen" = "Enter Full Screen";
"MnTitleExitFullScreen" = "Exit Full Screen";

//table view header title
"RESULT" = "Result: ";

//PDFOutline not exist dialog message
"NotExistOutline_msg" = "This document does not have any bookmarks.";
"NotExistOutline_info" = "if needed, please start to make a new bookmark from bookmark menu.";

//New Bookmark Undefined Label
"UntitledLabal" = "Untitled";

//New Bookmark from Selection NoSelection dialog message
"NoSelectBM_msg" = "New Bookmark from Selection Error:";
"NoSelectBM_info" = "No Objects Are Selected.\nChoose menu item \"New Bookmark from Selection\" after choosing the location where the bookmark is set.";

//Menu item Show or Hide Bookmark Panel
"ShowBM" = "Show Bookmark Panel";
"HideBM" = "Hide Bookmark Panel";

//Bookmark panel empty input error message
"OLLabel_msg" = "Label is empty.";
"PageIndex_msg" = "Page index of destination is empty.";
"PointX_msg" = "Point x of destination is empty.";
"PointY_msg" = "Point y of destination is empty.";
"EmptyErr_info" = "This field value cannot be empty. Please input rightly.";

//Menu item Show or Hide Text Panel
"ShowTP" = "Show Text Panel";
"HideTP" = "Hide Text Panel";

//Menu item Show or Hide Font Panel
"ShowFont" = "Show Fonts";
"HideFont" = "Hide Fonts";

//Menu item Show or Hide Color Panel
"ShowColor" = "Show Colors";
"HideColor" = "Hide Colors";

//Document encrypted allert dialog
"EncryptedMsg" = "This document is encrypted with password.";
"EncryptedInfo" = "If you continue processing, the document will be decrypted. If you don't want it, click the cancel button and select the menu item \"File\" → \"Show Document Info\" and perform encrypting. Then encrypted file will be saved.";

//Document Changed Alert Dialog Button Title
"Continue" = "Continue";
"Cancel" = "Cancel";

//AllertWithOKBtn
"LockedMsg" = "To get text requires the permission to copy this document.";
"LockedInfo" = "To unlock copying, select the menu item \"File\" → \"Input Password...\".";

//for split document
"Choose" = "Choose";
"ChooseFolder" = "Choose folder.";
"fileNameAlertMsg" = "already exists. Do you want to replace it?";
"fileNameAlertInfo" = "A file or folder with the same name already exists. Replacing it will overwrite its current contents.";
"Suspend" = "Suspend the Processing";
"Replace" = "Replace";
"PRangeMsg" = "Page Range Error:";
"PRangeInfo" = "The value of the page range is not correct.";
"PageEmpty" = "Page range is not inputed.";
"CharError" = "The specified page range includes inappropriate characters.";
"AllPages" = "The application cannot remove all pages.";

//pass win
"UnlockMsg" = "You don't have full permissions of this document.";
"UnlockInfo" = "To enable full permissions of this document, you must input the owner password.";
"UnlockPrintMsg" = "You don't have permission to print this document.";
"UnlockPrintInfo" = "Enter the owner password to unlock printing the document.";
"UnlockCopyMsg" = "You don't have permission to copy portions of this document.";
"UnlockCopyInfo" = "Enter the owner password to unlock copying from the document.";
"UnlockEditMsg" = "You don't have permission to edit the information of this document.";
"UnlockEditInfo" = "Enter the owner password to unlock editing the document information.";

//EncryptPanel alert
"passSameMsg" = "User password and owner password must be different.";
"oNoneMsg" = "To lock copying or printing requires owner password.";
"oNoneInfo" = "Input owner password and its confirmation.";
"uPassMsg" = "The inputed value of the user password is different from the inputed value for confirmation.";
"oPassMsg" = "The inputed value of the owner password is different from the inputed value for confirmation.";
"passInfo" = "Re-try updating after re-input the passwords to the text field for registration and the text field for confirmation.";

//Info Panel
"Encrypted" = "Encrypted";
"None" = "None";
"Allow" = "Allow";
"Forbid" = "Forbid";
"Unlock" = "Click the lock to update.";
"Lock" = "Click the lock to prevent updating.";

